// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

//3, 5 -> 243 (3⁵)

//2, 4 -> 16

Console.WriteLine("Enter first integer number");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Enter second integer number");
int power = Convert.ToInt32(Console.ReadLine());
for (power = 0; power <= power; power++)
{
    Console.WriteLine($"{x}^{power} = {Math.Pow(x, power)}");
}

